# パイプを理解する

パイプを使用して、文字列、通貨額、日付、その他のデータを画面表示用に変換します。

## パイプとは

パイプは、テンプレートで使用されるシンプルな関数であり、入力値を受け取って変換された値を返します。パイプは、パイプを一度だけ宣言するだけでアプリケーション全体でパイプを使用できるため、便利です。
たとえば、パイプを使用して、生の文字列ではなく、**1988年4月15日**のように日付を表示します。

独自のパイプを作成して、テンプレートで再利用可能な変換を公開できます。

## 組み込みパイプ

Angularは、国際化（i18n）のための変換を含む、一般的なデータ変換のための組み込みパイプを提供しています。これは、ロケール情報を用いてデータをフォーマットします。
以下は、データフォーマットによく使用される組み込みパイプです。

- [`DatePipe`](api/common/DatePipe): ロケールルールに従って日付値をフォーマットします。
- [`UpperCasePipe`](api/common/UpperCasePipe): テキストをすべて大文字に変換します。
- [`LowerCasePipe`](api/common/LowerCasePipe): テキストをすべて小文字に変換します。
- [`CurrencyPipe`](api/common/CurrencyPipe): ロケールルールに従って、数値を通貨文字列に変換します。
- [`DecimalPipe`](/api/common/DecimalPipe): ロケールルールに従って、数値を小数点付きの文字列に変換します。
- [`PercentPipe`](api/common/PercentPipe): ロケールルールに従って、数値をパーセンテージ文字列に変換します。
- [`AsyncPipe`](api/common/AsyncPipe): Observableなどの非同期ソースを購読および購読解除します。
- [`JsonPipe`](api/common/JsonPipe): デバッグのために、コンポーネントオブジェクトのプロパティをJSONとして画面に表示します。

Note: 組み込みパイプの完全なリストについては、[パイプAPIドキュメント](/api?type=pipe "パイプAPIリファレンスサマリー")を参照してください。
国際化（i18n）におけるパイプの使用の詳細については、[ロケールに基づくデータのフォーマット](guide/i18n/format-data-locale)を参照してください。
